app/views/chefs/index.html.erb

        <td><%= recipe.name %></td>
        <td><%= recipe.chef.first_name %></td>
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]