app/views/recipes/index.html.erb

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <td><%= recipe.name %></td>
        <td><%= recipe.chef.first_name %></td>