app/controllers/chefs_controller.rb

SELECT "chefs".* FROM "chefs"
SELECT "recipes".* FROM "recipes"
---
  def index
    @chefs = Chef.all
    @recipes = Recipe.all

INSERT INTO "chefs" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "test"], ["last_name", "test"], ["created_at", "2017-11-22 22:39:58.516440"], ["updated_at", "2017-11-22 22:39:58.516440"]]
---
  def create
    @chef = Chef.new(chef_params)

    respond_to do |format|
      if @chef.save

UPDATE "chefs" SET "first_name" = $1, "updated_at" = $2 WHERE "chefs"."id" = $3  [["first_name", "Soraya"], ["updated_at", "2017-11-22 22:39:50.418672"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @chef.update(chef_params)

DELETE FROM "chefs" WHERE "chefs"."id" = $1  [["id", 4]]
---
  def destroy
    @chef.destroy

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_chef
      @chef = Chef.find(params[:id])