app/controllers/recipes_controller.rb

SELECT "chefs".* FROM "chefs"
---
  def new
    @recipe = Recipe.new
    @chefs = Chef.all

INSERT INTO "recipes" ("name", "chef_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "chips"], ["chef_id", 1], ["created_at", "2017-11-22 22:57:02.956467"], ["updated_at", "2017-11-22 22:57:02.956467"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "chef_id" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["chef_id", 3], ["updated_at", "2017-11-23 00:01:08.385691"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 4]]
---
  def destroy
    @recipe.destroy